
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчётСотрудников
	Движения.УчётСотрудников.Записывать = Истина;
	Движения.УчётСотрудников.Очистить();
	Движение = Движения.УчётСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
	Движение.Оклад = Оклад;
	Движение.ПричинаИзмененияСостояния = Перечисления.ПричинаИзмененияСостояния.Увольнение;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
