Функция ПроверкаСотрудника(Сотрудник)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчётСотрудников.Период КАК Период
		|ИЗ
		|	РегистрСведений.УчётСотрудников КАК УчётСотрудников
		|ГДЕ
		|	УчётСотрудников.Сотрудник = &Сотрудник
		|	И УчётСотрудников.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриёмНаРаботу)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ЕСЛИ ПроверкаСотрудника(Сотрудник) Тогда
		Сообщить("Такой сотрудник уже трудоустроен");
		Возврат;
	КонецЕсли;
	// регистр УчётСотрудников
	Движения.УчётСотрудников.Записывать = Истина;
	Движения.УчётСотрудников.Очистить();
	Движение = Движения.УчётСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
	Движение.Оклад = Оклад;
	Движение.ПричинаИзмененияСостояния = Перечисления.ПричинаИзмененияСостояния.ПриёмНаРаботу;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
